<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	
	<key>Description</key>
	<string>Downloads the latest version of Audacity.</string>
	<key>Identifier</key>
	<string>com.github.AlfAlpha1.download.Audacity</string>
	<key>Input</key>
	<dict>
		
		<key>NAME</key>
		<string>Audacity</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.fosshub.com/Audacity.html?dwl=audacity-macos-3.1.3-Intel.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>		
				<key>Processor</key>
				<string>URLDOWNLOADER</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>filename</key>
					<string>%Name%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.pkg</string>
				<key>requirement</key>
				<string>identifier "org.audacityteam.audacity" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = AWEYX923UX</string>
			</dict>
		</dict>
		<dict>
			
			<key>Processor</key>
			<string>Endofcheckkphase</string>
		</dict>
	</array>
</dict>
</plist>
